// import {} from './types';

const initialState = [
  {
    id: 1,
    name: 'Fortuna Ssh',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description: 'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '16999',
    rate: '5*',
    filters: ['5*', 'Сніданок, обід і вечеря', 'Безкоштовний Wi-Fi', 'Розміщення з тваринами', 'Дитячий басейн', 'Дитяче меню', 'Водяні гірки', '1-ша лінія', 'Шарм-ель-Шейх'],
    services: [
      {
        title: 'Про отель',
        main: ['Пляжний', 'Check-in 14:00', 'Check-out 12:00'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Місцезнаходження',
        main: ['1 лінія (на березі моря)'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Територія',
        /* main: [], */
        free: ['Wi-Fi на території', 'Місця для паркування'],
        /* paid: [] */
      },
      {
        title: 'Пляж',
        main: ['Пісчаний', 'Власний'],
        /* free: [], */
        paid: ['Парасольки', 'Бар', 'Рушники', 'Шезлонги'],
      },
      {
        title: 'Номера',
        /* main: [], */
        free: ['Фен', 'Кондиціонер'],
        paid: ['Wi-Fi в номері', 'Міні-бар в номері', 'Сейф', 'Праска'],
      },
      {
        title: 'Басейни',
        /* main: [], */
        free: ['Парасольки', 'Шезлонги', 'Рушники'],
        paid: [],
      },
      {
        title: 'Розваги',
        /* main: [], */
        free: ['Аніматори', 'Дискотека', 'Настільний теніс'],
        paid: ['Сауна', 'Більярд', 'Водний спорт', 'Фітнес клуб'],
      },
    ],
  },
  {
    id: 2,
    name: 'Fortuna hhh',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description: 'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '8871',
    rate: '3*',
    filters: ['3*', 'Розміщення з тваринами', 'Дитячий басейн', 'Водяні гірки', '1-ша лінія', 'Шарм-ель-Шейх'],
    services: [
      {
        title: 'Про отель',
        main: ['Пляжний', 'Check-in 14:00', 'Check-out 12:00'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Місцезнаходження',
        main: ['1 лінія (на березі моря)'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Територія',
        /* main: [], */
        free: ['Wi-Fi на території', 'Місця для паркування'],
        /* paid: [] */
      },
      {
        title: 'Пляж',
        main: ['Пісчаний', 'Власний'],
        /* free: [], */
        paid: ['Парасольки', 'Бар', 'Рушники', 'Шезлонги'],
      },
      {
        title: 'Номера',
        /* main: [], */
        free: ['Фен', 'Кондиціонер'],
        paid: ['Wi-Fi в номері', 'Міні-бар в номері', 'Сейф', 'Праска'],
      },
      {
        title: 'Басейни',
        /* main: [], */
        free: ['Парасольки', 'Шезлонги', 'Рушники'],
        paid: [],
      },
      {
        title: 'Розваги',
        /* main: [], */
        free: ['Аніматори', 'Дискотека', 'Настільний теніс'],
        paid: ['Сауна', 'Більярд', 'Водний спорт', 'Фітнес клуб'],
      },
    ],
  },
  {
    id: 3,
    name: 'Fortuna adw',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description: 'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '12399',
    rate: '4*',
    filters: ['4*', 'Безкоштовний Wi-Fi', 'Розміщення з тваринами', 'Дитячий басейн', 'Водяні гірки', '2-га лінія', 'Шарм-ель-Шейх'],
    services: [
      {
        title: 'Про отель',
        main: ['Пляжний', 'Check-in 14:00', 'Check-out 12:00'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Місцезнаходження',
        main: ['1 лінія (на березі моря)'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Територія',
        /* main: [], */
        free: ['Wi-Fi на території', 'Місця для паркування'],
        /* paid: [] */
      },
      {
        title: 'Пляж',
        main: ['Пісчаний', 'Власний'],
        /* free: [], */
        paid: ['Парасольки', 'Бар', 'Рушники', 'Шезлонги'],
      },
      {
        title: 'Номера',
        /* main: [], */
        free: ['Фен', 'Кондиціонер'],
        paid: ['Wi-Fi в номері', 'Міні-бар в номері', 'Сейф', 'Праска'],
      },
      {
        title: 'Басейни',
        /* main: [], */
        free: ['Парасольки', 'Шезлонги', 'Рушники'],
        paid: [],
      },
      {
        title: 'Розваги',
        /* main: [], */
        free: ['Аніматори', 'Дискотека', 'Настільний теніс'],
        paid: ['Сауна', 'Більярд', 'Водний спорт', 'Фітнес клуб'],
      },
    ],
  },
  {
    id: 4,
    name: 'Fortuna ggg',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description: 'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '15599',
    rate: '5*',
    filters: ['5*', 'Сніданок, обід і вечеря', 'Безкоштовний Wi-Fi', 'Розміщення з тваринами', 'Дитячий басейн', 'Дитяче меню', 'Водяні гірки', '1-ша лінія', 'Шарм-ель-Шейх'],
    services: [
      {
        title: 'Про отель',
        main: ['Пляжний', 'Check-in 14:00', 'Check-out 12:00'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Місцезнаходження',
        main: ['1 лінія (на березі моря)'],
        /* free: [],
          paid: [] */
      },
      {
        title: 'Територія',
        /* main: [], */
        free: ['Wi-Fi на території', 'Місця для паркування'],
        /* paid: [] */
      },
      {
        title: 'Пляж',
        main: ['Пісчаний', 'Власний'],
        /* free: [], */
        paid: ['Парасольки', 'Бар', 'Рушники', 'Шезлонги'],
      },
      {
        title: 'Номера',
        /* main: [], */
        free: ['Фен', 'Кондиціонер'],
        paid: ['Wi-Fi в номері', 'Міні-бар в номері', 'Сейф', 'Праска'],
      },
      {
        title: 'Басейни',
        /* main: [], */
        free: ['Парасольки', 'Шезлонги', 'Рушники'],
        paid: [],
      },
      {
        title: 'Розваги',
        /* main: [], */
        free: ['Аніматори', 'Дискотека', 'Настільний теніс'],
        paid: ['Сауна', 'Більярд', 'Водний спорт', 'Фітнес клуб'],
      },
    ],
  },
];

export const toursReducer = (state = initialState, action) => {
  switch (action.type) {
    default:
      return state;
  }
};
