// import {} from './types';

const initialState = [
  {
    name: 'Fortuna Ssh 4*',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description:
      'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '8871'
  },
  {
    name: 'Fortuna hhh 4*',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description:
      'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '8871'
  },
  {
    name: 'Fortuna adw 4*',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description:
      'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '8871'
  },
  {
    name: 'Fortuna ggg 4*',
    country: 'Єгипет',
    resort: 'Шарм-эль-Шейх',
    startDate: '',
    endDate: '',
    description:
      'При покупке туров в отель системы Fortuna туристы размещаются в одном из отелей указанной категории (2*, 3*, 4*, 5*). Воспользуйтесь прекрасной возможностью испытать судьбу, приготовить себе сюрприз и при этом сэкономить деньги!',
    price: '8871'
  }
];

export const toursReducer = (state = initialState, action) => {
  switch (action.type) {
    default:
      return state;
  }
};
